import React from 'react';
import SightCard from './Card';
import ContainerLayout from '../../UI/ContainerLayout';

const description =
  // eslint-disable-next-line max-len
  'Рилският манастир е български ставропигиален манастир, един от най-значимите културни паметници в България, символ на страната, включен в списъка за световното наследство на ЮНЕСКО. Разположен е в Югозападна България, област Кюстендил, община Рила. Основан е през Х век от св. Йоан Рилски Чудотворец[1] в горното течение на Рилска река.Рилският манастир, в т.число Хрельовата кула, църквата, манастирските сгради и църквата „Свети Лука“ са обявени през 1927 г. за „народна старина“ („Държавен вестник“, бр.69 от 1927 г.).През 1968 г. Хрельовата кула е обявена за архитектурно-строителен паметник на културата от Средновековието („Държавен вестник“, бр.77 от 1968 г.). На 7-та сесия на Комитета за световно наследство към ЮНЕСКО, проведена от 5 до 9 декември 1983 г. във Флоренция (Италия), Рилският манастир е обявен за обект на световното културно наследство. В Рилския манастир се пазят ръкописи, старопечатни книги, документи от 14 век – 19 век, а в музея – много старинни предмети, като черковна утвар, жезли, икони, оръжия, монетна колекция и др. През 1992 г. Рилският манастир; Гробът на Св. Йоан Рилски, включващ църквата „Успение на Св. Йоан Рилски“ и постницата Св. Йоан Рилски; Скитът „Свети Лука“, включващ църквите „Свети Лука“ и „Свети Покров Богородичен“ и килийното училище; метохът Орлица с църквата „Св. св. Петър и Павел“; и църквата „Успение Богородично“ са обявени за групови архитектурни, исторически и художествени комплекси от национално значение, а метохът Пчелино – за групов архитектурен и исторически комплекс от местно значение („Държавен вестник“, бр.73 от 1992 г.) ';
const sight = {
  'id': '123',
  'name': 'Рилският манастир',
  description,
  'picturePath': '/tmp/pic1',
  'workingTimeFrom': '8',
  'workingTimeTo': '20',
  'price': '12',
  'address': 'община Рила, България',
  'rating': 7.2,
  'weather': {
    'temp': 21,
    'outlook': 'Предимно слънчево'
  },
  'category': 'rest'
};

const sight2 = {
  ...sight,
  'id': '124'
};

const sight3 = {
  ...sight,
  'id': '125'
};

const sights = [sight, sight2, sight3];

const SightsList = () => {
  const sightsList = sights.map(
    sight => <SightCard sight={sight} key={sight.id}/>
  );

  return <ContainerLayout header="Sights list">{sightsList}</ContainerLayout>;
};

export default SightsList;
